#include <iostream> // библиотека для ввода и вывода
#include <clocale>  // (исправление кодировки)
int main() // Главная функция
{ // тела функции main
    setlocale(LC_ALL, "Russian"); // исправление кодировки
    std::cout << "First string" << std::endl; // вывод строки "First string" в консоль
    std::cout << "Первая строка\nВторая строка" << std::endl; // вывод двух строк с разделением через символ \n
    std::cout << "Спецсимволы \"\\\"" << std::endl; // вывод строки с экранированием кавычек (\") и слеша (\\)
    return 0; // Возврат кода 0 операционной системе в знак успешного завершения программы
} // закрывающая фигурная скобка главной функции main
